eringerli/esp32-aog/src/main.cpp
        switch ( initialisation.outputType ) {
          case SteerConfig::OutputType::SteeringMotorIBT2: {
            ledcWriteTone( 0, steerConfig.pwmFrequency );
            ledcWriteTone( 1, steerConfig.pwmFrequency );
          }
          break;

          default:
            break;
        }
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "1000" ), ControlColor::Peterriver, sel );
      ESPUI.addControl( ControlType::Max, "Max", String( "5000" ), ControlColor::Peterriver, sel );
      ESPUI.addControl( ControlType::Step, "Step", String( "100" ), ControlColor::Peterriver, sel );
    }
  }
  
  {
    uint16_t tab  = ESPUI.addControl( ControlType::Tab, "Steering PID", "Steering PID" );

    ESPUI.addControl( ControlType::Switcher, "Allow AgOpenGPS to overwrite PID values", String( steerConfig.allowPidOverwrite ? "1" : "0" ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.allowPidOverwrite = control->value.toInt() == 1;
    } );
    
    {
      uint16_t wheel = ESPUI.addControl( ControlType::Number, "PID Kp", String( steerConfig.steeringPidKp ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKp = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Step, "Step", String( ".01" ), ControlColor::Peterriver, wheel );
    }
    {
      uint16_t wheel = ESPUI.addControl( ControlType::Number, "PID Ki", String( steerConfig.steeringPidKi ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKi = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Step, "Step", String( ".0001" ), ControlColor::Peterriver, wheel );
    }
    {
      uint16_t wheel = ESPUI.addControl( ControlType::Number, "PID Kd", String( steerConfig.steeringPidKd ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidKd = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Step, "Step", String( ".0001" ), ControlColor::Peterriver, wheel );
    }
    {
      uint16_t wheel = ESPUI.addControl( ControlType::Number, "Turn Output on if error is greater (BangOn)", String( steerConfig.steeringPidBangOn ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidBangOn = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Step, "Step", String( ".1" ), ControlColor::Peterriver, wheel );
    }
    {
      uint16_t wheel = ESPUI.addControl( ControlType::Number, "Turn Output off if error is smaller (BangOff)", String( steerConfig.steeringPidBangOff ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidBangOff = control->value.toDouble();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Max, "Max", String( "50" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Step, "Step", String( ".1" ), ControlColor::Peterriver, wheel );
    }
    
    {
      uint16_t wheel = ESPUI.addControl( ControlType::Number, "Distance from Line to turn Integral/Derivative of PID off", String( steerConfig.steeringPidDflTurnIdOff ), ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.steeringPidDflTurnIdOff = control->value.toInt();
      } );
      ESPUI.addControl( ControlType::Min, "Min", String( "0" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Max, "Max", String( "200" ), ControlColor::Peterriver, wheel );
      ESPUI.addControl( ControlType::Step, "Step", String( "1" ), ControlColor::Peterriver, wheel );
    }
    
  }

  {
    uint16_t tab  = ESPUI.addControl( ControlType::Tab, "Switches/Buttons", "Switches/Buttons" );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Input Workswitch*", String( ( int )steerConfig.gpioWorkswitch ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioWorkswitch = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioInput( sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Workswitch LED*", String( ( int )steerConfig.gpioWorkswitch ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioWorkswitch = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }

    ESPUI.addControl( ControlType::Switcher, "Autosteer input as Button*", String( steerConfig.autosteerButton ? "1" : "0" ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      steerConfig.autosteerButton = control->value.toInt() == 1;
    } );
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Input Autosteer switch/button*", String( ( int )steerConfig.gpioSteerswitch ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSteerswitch = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioInput( sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Autosteer LED*", String( ( int )steerConfig.gpioSteerswitch ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioSteerswitch = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioOutput( sel );
    }
  }

  {
    uint16_t tab  = ESPUI.addControl( ControlType::Tab, "Steering Wheel Encoder", "Steering Wheel Encoder" );

    ESPUI.addControl( ControlType::Switcher, "Steering Wheel Encoder*", String( steerConfig.steeringWheelEncoder ? "1" : "0" ), ControlColor::Wetasphalt, tab,
    []( Control * control, int id ) {
      steerConfig.steeringWheelEncoder = control->value.toInt() == 1;
      setResetButtonToRed();
    } );

    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Steering Wheel Encoder Input A*", String( ( int )steerConfig.gpioWheelencoderA ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioWheelencoderA = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioInput( sel );
      addGpioOutput( sel );
    }
    {
      uint16_t sel = ESPUI.addControl( ControlType::Select, "Steering Wheel Encoder Input B*", String( ( int )steerConfig.gpioWheelencoderB ), ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        steerConfig.gpioWheelencoderB = ( SteerConfig::Gpio )control->value.toInt();
        setResetButtonToRed();
      } );
      ESPUI.addControl( ControlType::Option, "None", "0", ControlColor::Alizarin, sel );
      addGpioInput( sel );
      addGpioOutput( sel );
    }

    ESPUI.addControl( ControlType::Number, "Steering Wheel Encoder max Counts", String( steerConfig.pulseCountMax ), ControlColor::Peterriver, tab,
    []( Control * control, int id ) {
      steerConfig.pulseCountMax = control->value.toInt();
    } );
  }

